app/controllers/accounts_controller.rb

  def create
    provider = request.env['omniauth.auth']['provider']
    # template_id = request.env['omniauth.params']['email_template_id']
    # template = current_user.email_templates.find(template_id)
    case provider
      when 'bigcommerce'
        auth = request.env['omniauth.auth']
        token = auth['credentials']['token'].token
        account = Account.create!(name: provider, token: token)
---
INSERT INTO `accounts` (`created_at`, `name`, `token`, `updated_at`) VALUES ('2015-07-25 20:33:52', 'bigcommerce', 'pbzlavvrdzwwcgfuuzdwwkbqtmtbqyc', '2015-07-25 20:33:52')