app/controllers/products_controller.rb

SELECT  `accounts`.* FROM `accounts`  WHERE `accounts`.`id` = 1 LIMIT 1
---
  def fetch
    puts "auth['credentials']\n"
    account = Account.find(params[:account_id])